//-------------------------------------------------------------------------------------
// All Rights Reserved , Copyright (C) 2011 , Hairihan TECH, Ltd. 
//-------------------------------------------------------------------------------------

namespace Sys.DbUtilities
{
    /// <summary>
    /// DataBaseType
    /// 有关数据库连接类型定义。
    /// 
    /// 修改纪录
    /// 
    ///		2011.02.22 版本：3.1  转移文件位置，还是不换为好。
    ///		2007.04.14 版本：3.0  检查程序格式通过，不再进行修改主键操作。
    ///		2006.11.17 版本：2.1  变量命规范化。
    ///		2006.04.18 版本：2.0  重新调整主键的规范化。
    ///		
    /// 版本：3.0
    /// 
    /// <author>
    ///		<name></name>
    ///		<date>2007.04.14</date>
    /// </author> 
    /// </summary>
    public enum DataBaseType
    {
        Oracle,
        SqlServer,
        Access,
        Bd2,
        MySql,
        SQLite
    }
}